Revit 2027 API
MacroManager.GetApplicationMacroSecurityOptions Method
 Gets the application macro security options.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ApplicationMacroOptions GetApplicationMacroSecurityOptions(
	Application application
)
Public Shared Function GetApplicationMacroSecurityOptions (
	application As Application
) As ApplicationMacroOptions
public:
static ApplicationMacroOptions GetApplicationMacroSecurityOptions(
	Application^ application
)
static member GetApplicationMacroSecurityOptions :
        application : Application -> ApplicationMacroOptions
Parameters
application Application
 The application.
Return Value
ApplicationMacroOptions
 Returns the application macro security options.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MacroManager Class
Autodesk.Revit.DB.Macros Namespace